"""
    Модуль содержит переменные с репликами бота.
"""

# ----------------------------------------------------------------------------------------------------------------------
WELCOME_TEXT = (
    f'Рады приветствовать Вас!\n\n'
    f'Этот бот предоставляет функционал управления задачами. '
    f'Доступны:\n'
    f'🟢  1) Добавление:, "add_task", description - Добавить новую задачу.\n'
    f'🟢  2) Удаление: "delete_task", description - Удалить задачу по ID.\n'
    f'🟢  3) Просмотр: "show_tasks", description - Показать список задач.\n'
    f'🟢  4) Перезапуск бота, просмотр инструкций: "start",\n'
    f'    description - Начать работу с ботом / получить инструкции по работе с ботом.'
)

ADD_TASK = '➕ ДОБАВИТЬ ЗАДАЧУ'
DELETE_TASK = '➖ УДАЛИТЬ ЗАДАЧУ'
SHOW_TASKS = '🔍 ПОКАЗАТЬ ЗАДАЧИ'
START = '♻️ ПЕРЕЗАПУСТИТЬ'







